routes/web.php

select * from "categories" where "categories"."id" in (1, 2, 3, 4, 5, 6)
select * from "posts" order by "created_at" desc
select * from "posts" where "posts"."category_id" = 4 and "posts"."category_id" is not null
select * from "posts" where "posts"."author_id" = 5 and "posts"."author_id" is not null
---
    return view('home');
});

Route::get('/posts', function () {

    // $posts = Post::with(['author', 'category'])->latest()->get();
    return view('posts', ['title' => 'Blog Page', 'posts' => Post::filter(request(['search', 'category', 'author']))->latest()->paginate(12)->withQueryString()]);
});